# -*- coding:utf-8 -*-
# @Time       :2022/11/5 & 10:06 AM
# @AUTHOR     :Arthur Xia
# @SOFTWARE   :JetBrains

import numpy as np
import pandas as pd

df = pd.DataFrame({
    '账号': [714466, 714466, 714466, 737550, 146832, 218895, 218895, 412290, 740150, 141962, 163416, 239344, 239344,
             307599, 688981, 729833, 729833],
    '客户名称': ['华山派股份有限公司', '华山派股份有限公司', '华山派股份有限公司', '丐帮(北京) 合伙人公司',
                 '恶人谷资产管理公司', '桃花岛', '桃花岛', '有间客栈', '逍遥子影业', '白驼山(上海)影视艺术有限公司',
                 '聚贤庄', '全真教药业', '全真教药业', '天地会快递', '福寿堂', '快手三教育培训有限公司',
                 '快手三教育培训有限公司'],
    '销售': ['令狐冲', '令狐冲', '令狐冲', '令狐冲', '江小鱼', '江小鱼', '江小鱼', '段誉', '段誉', '欧阳克', '欧阳克',
             '欧阳克', '欧阳克', '韦小宝', '韦小宝', '韦小宝', '韦小宝'],
    '销售总监': ['岳不群', '岳不群', '岳不群', '岳不群', '岳不群', '岳不群', '岳不群', '岳不群', '岳不群', '完颜洪烈',
                 '完颜洪烈', '完颜洪烈', '完颜洪烈', '完颜洪烈', '完颜洪烈', '完颜洪烈', '完颜洪烈'],
    '产品': ['黑玉断续膏', '葵花宝典', '含笑半步癫', '黑玉断续膏', '黑玉断续膏', '黑玉断续膏', '葵花宝典', '含笑半步癫',
             '黑玉断续膏', '黑玉断续膏', '黑玉断续膏', '含笑半步癫', '葵花宝典', '含笑半步癫', '黑玉断续膏',
             '黑玉断续膏', '如意勾'],
    '数量': [1, 2, 1, 3, 1, 3, 1, 2, 4, 2, 2, 1, 3, 5, 2, 3, 1],
    '价格': [3000, 2000, 1000, 3000, 1000, 3000, 1000, 2000, 4000, 2000, 2000, 1000, 2000, 3000, 1000, 4000, 2000],
    '状态': ['流程中', '流程中', '待审批', '驳回', '已完成', '流程中', '流程中', '待审批', '驳回', '已完成', '流程中',
             '待审批', '待审批', '已完成', '已完成', '驳回', '流程中'],
})

print(df)

# index
# 指定单索引
print('----------------------DIVIDED-------------------------')

a = pd.pivot_table(df, index=['客户名称'])

print(a)
# 索引变成了[客户名称]这一列，values显示的只有数字，而且都处理成均值。
# 比如：华山三个，数量4/3，价格6000/3，账号就不用说了，三个都一样，均值自然就是其中一个；快手两个，数量4/2，价格6000/2

# 会把数字 都提取出来

print('----------------------DIVIDED-------------------------')

# 指定多索引
# 索引顺序能决定不同的视觉体验，虽然结果是一致的。

a = pd.pivot_table(df, index=['销售总监', '销售', '客户名称'])
print(a)

print('----------------------DIVIDED-------------------------')
# values

# 如果不需要显示全部的数列值，可以用values参数指定

# print(pd.pivot_table(df, index=['销售总监','销售'], values=['状态']))
# values 不可以随便指定

print(pd.pivot_table(df, index=['销售总监', '销售'], values=['状态', '价格']))
#                    价格
# 销售总监 销售
# 完颜洪烈 欧阳克  1750.000000
#      韦小宝  2500.000000
# 岳不群  令狐冲  2250.000000
#      段誉   3000.000000
#      江小鱼  1666.666667

# 必须需要有数据
# 数据透视表


